all-start.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-01-02 Thu 16:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Vincent Zhang" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbbe3417">1. 第一戒 (最终版)</a></li>
<li><a href="#org6aee13c">2. 第四戒(最终版)</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgbbe3417" class="outline-2">
<h2 id="orgbbe3417"><span class="section-number-2">1</span> 第一戒 (最终版)</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>当在一个由原子构成的列表(lat)上递归时，问两个问题：（null? lat） 还有 else</li>
<li>当在一个数字上递归时，问两个问题：（zero? n） 还有 else</li>
<li>当在一个由s-表达式构成的列表(复合列表)上递归时，问三个问题： （null？ l）,(atom? (car l)), 还有else</li>
</ol>
</div>
</div>


<div id="outline-container-org6aee13c" class="outline-2">
<h2 id="org6aee13c"><span class="section-number-2">2</span> 第四戒(最终版)</h2>
<div class="outline-text-2" id="text-2">
<p>
递归时至少要有一个参数变化，并且向终止条件方向变化。变化的参数必须有终止测试条件：当递归原子
(lat)时使用(cdr lat). 当递归数n时使用(sub1 n).当递归一个s表达式的列表l,当(null? l) 或者(atom? (car l)) 使用(car l) 和 (cdr l)
递归时参数要向终止条件方向变化: 当使用cdr时,用null?测试终止
当使用sub1时,用zero?测试终止
</p>


<div class="org-src-container">
<pre class="src src-scheme">  (define rember*
   (lambda (a l)
     (cond
      ((null? l) (quote ()))
      ((not (list? (car l)))
       (cond
        ((eq? (car l) a)
         (rember* a (cdr l)))
        (else (cons (car l)
                    (rember* a (cdr l))))))
      (else (cons (rember* a (car l))
                  (rember* a (cdr l)))))))
(rember* 'suace '(((tomato sauce)) ((bean) sauce) (and ((flying)) sauce)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(define insertR*
  (lambda (new old l)
    (cond
      ((null? l) '())
      ((not (list? (car l)))
       (cond
         ((eq? (car l) old)
          (cons old
                (cons new
                      (insertR*  new old
                                 (cdr l)))))
         (else (cons (car l)
                     (insertR* new old (cdr l))))))
      (else (cons (insertR* new old (car l)) (insertR* new old (cdr l)))))))
</pre>
</div>
<div class="org-src-container">
<pre class="src src-scheme">  (define occur*
   (lambda (a l)
     (cond
       ((null? l) 0)
       ((not (list? (car l)))
        (cond
          ((eq? a (car l))
           (add1 (occur* a (cdr l))))
          (else (occur* a (cdr l)))))
       (else (+ (occur* a (car l)) (occur* a (cdr l)))))))

(occur* 'banana '((banana)
 (split ((((banana ice)))
         (cream (banana))
         sherbet))
 (banana)
 (bread)
 (banana brandy)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">  (define subst*
    (lambda (new old l)
      (cond
        ((null? l) '())
        ((not (list? (car l)))
         (cond
           ((eq? old (car l))
            (cons new (subst* new old (cdr l))))
           (else (cons (car l) (subst* new old (cdr l))))))
        (else (cons (subst* new old (car l)) (subst* new old (cdr l)))))))

(subst* 'orange 'banana '((banana)
 (split ((((banana ice)))
        (cream (banana))
        sherbet))
(banana)
(bread)
(banana brandy)))
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Vincent Zhang</p>
<p class="date">Created: 2020-01-02 Thu 16:24</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
